OdRxClass.delX(OdRxClass*)
\details
Deletes the Protocol Extension for the specified Protocol Extension class.
\returns
Returns the Protocol Extension Object.
\param pProtocolClass [in]  Pointer to the Protocol Extension class.
\remarks
As currently implemented, this function does nothing but
assert in debug mode, and return a null pointer.
It will be fully implemented in a future *release*.

OdRxClass.getX(OdRxClass!System.Runtime.CompilerServices.IsConst*)
\details
Returns the Protocol Extension for the specified
Protocol extension class.
\param pProtocolClass [in]  Pointer to the Protocol Extension class.
\returns
Returns a SmartPointer to the Protocol Extension.
\remarks
The default implementation of this object does nothing but
assert in debug mode, and return a null pointer.
It will be fully implemented in a future *release*.

OdRxClass.addX(OdRxClass*,OdRxObject*)
\details
Creates the Protocol Extension for the specified OdRxClass.
\param pProtocolClass [in]  Pointer to the Protocol Extension class.
\param pProtocolObject [in]  Pointer to the Protocol Extension Object.
\returns
Returns a SmartPointer to the Protocol Extension.
\remarks
The default implementation of  this object does nothing but return a
null pointer, and asserts in debug mode. It will be
fully implemented in a future *release*.